export const HIDE_ELEMENT_CLASS = 'hidden';
export const MODAL_OPEN_CLASS = 'modal-open';

export const LOAD_MORE_INCREMENT = 5;

export const FAKE_PHOTOS_COUNT = 25;
export const MIN_FAKE_PHOTO_ID = 1;
export const FAKE_AVATARS_COUNT = 6;
export const MAX_SENTENCES_IN_FAKE_COMMENT_MESSAGE = 2;
export const MAX_FAKE_COMMENTS_PER_PHOTO = 30;
export const MIN_FAKE_COMMENT_ID = 0;

export const FakeLikes = {
  Min: 15,
  Max: 250,
};

export const FAKE_USER_MESSAGES = [
  'Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!',
];

export const FAKE_PHOTO_COMMENTS = [
  'Прекрасный пляж! Интересно, сколько чаек нужно, чтобы унести все эти шезлонги?',
  'Не все дороги ведут в Рим, какие-то - на пляж',
  'Очередная, неоригинальная фотка камней на пляже',
  '#сказочноебали',
  'Уровень расслабленности: рисовый человечек в мясной подливке',
  'Волк не смотрит на спидометр, он чувствует мотор',
  'Кто-нибудь видел такие вилки с тремя зубцами? Где можно купить?',
  'Класная брага получится!',
  'Последняя фотография самолета, который оставил нас на необитаемом острове',
  'Кто-то снова спионерил тапки',
  'Долбаные лабиринты! Кое-как нашел дорогу на пляж',
  'Когда не хватило денег на BMW',
  'Огурчики, помидорчики - все свое, с огорода',
  'Не еш, подумой!',
  'Тапки железного человека',
  'Прекрасный вид, несмотря на то, что мой парашют не раскрылся',
  'Опять хор орет на дирижера',
  'Пацанский таз - радует глаз',
  'Тот момент, когда твои ноги наконец-то увидели светлое будущее (или хотя бы путь к бутербродам)',
  'Даже у пальм есть подсветка, а у нас в подъезде второй месяц не могут лампочку поменять',
  'Конечно, не оливьешка, но тоже не плохо',
  'Такой прекрасный закат не испортит даже тонущий человек',
  'Вы когда-нибудь просыпались утром с чувством, что вы - краб?',
  'Люди показывают cимволы Иллюминатов на концерте Rammstein!?',
  'Слышь, командир, мелочь есть? А если найду?!',
];

export const FAKE_USER_NAMES = [
  'Артемий',
  'Даниил',
  'Егор',
  'Гордей',
  'Тимофей',
  'Руслан',
  'Марат',
  'Ярослав',
  'Родион',
  'Савелий',
  'Алёна',
  'Вероника',
  'Таисия',
  'Мирослава',
  'Кира',
  'Полина',
  'Варвара',
  'Злата',
  'Алина',
  'Евгения',
];
